rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SIM.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_SIM.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_SIM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_SIM_H_) /* Check if memory map has not been already included */
#define S32M24x_SIM_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Peripheral_Access_Layer SIM Peripheral Access Layer
 * @{
 */

/** SIM - Register Layout Typedef */
typedef struct {
    uint8_t RESERVED_0[4];
    __IO uint32_t CHIPCTL; /**< Chip Control register, offset: 0x4 */
    uint8_t RESERVED_1[4];
    __IO uint32_t FTMOPT0; /**< FTM Option Register 0, offset: 0xC */
    __IO uint32_t LPOCLKS; /**< LPO Clock Select Register, offset: 0x10 */
    uint8_t RESERVED_2[4];
    __IO uint32_t ADCOPT;   /**< ADC Options Register, offset: 0x18 */
    __IO uint32_t FTMOPT1;  /**< FTM Option Register 1, offset: 0x1C */
    __IO uint32_t MISCTRL0; /**< Miscellaneous control register 0, offset: 0x20 */
    __I uint32_t SDID;      /**< System Device Identification Register, offset: 0x24 */
    uint8_t RESERVED_3[24];
    __IO uint32_t PLATCGC; /**< Platform Clock Gating Control Register, offset: 0x40 */
    uint8_t RESERVED_4[8];
    __I uint32_t FCFG1; /**< Flash Configuration Register 1, offset: 0x4C */
    uint8_t RESERVED_5[4];
    __I uint32_t UIDH;  /**< Unique Identification Register High, offset: 0x54 */
    __I uint32_t UIDMH; /**< Unique Identification Register Mid-High, offset: 0x58 */
    __I uint32_t UIDML; /**< Unique Identification Register Mid Low, offset: 0x5C */
    __I uint32_t UIDL;  /**< Unique Identification Register Low, offset: 0x60 */
    uint8_t RESERVED_6[4];
    __IO uint32_t CLKDIV4;  /**< System Clock Divider Register 4, offset: 0x68 */
    __IO uint32_t MISCTRL1; /**< Miscellaneous Control register 1, offset: 0x6C */
} SIM_Type, *SIM_MemMapPtr;

/** Number of instances of the SIM module. */
#define SIM_INSTANCE_COUNT (1u)

/* SIM - Peripheral instance base addresses */
/** Peripheral SIM base address */
#define IP_SIM_BASE (0x40048000u)
/** Peripheral SIM base pointer */
#define IP_SIM ((SIM_Type*)IP_SIM_BASE)
/** Array initializer of SIM peripheral base addresses */
#define IP_SIM_BASE_ADDRS                                                                          \
    {                                                                                              \
        IP_SIM_BASE                                                                                \
    }
/** Array initializer of SIM peripheral base pointers */
#define IP_SIM_BASE_PTRS                                                                           \
    {                                                                                              \
        IP_SIM                                                                                     \
    }

/* ----------------------------------------------------------------------------
   -- SIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Register_Masks SIM Register Masks
 * @{
 */

/*! @name CHIPCTL - Chip Control register */
/*! @{ */

#define SIM_CHIPCTL_ADC_INTERLEAVE_EN_MASK (0xFU)
#define SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT (0U)
#define SIM_CHIPCTL_ADC_INTERLEAVE_EN_WIDTH (4U)
#define SIM_CHIPCTL_ADC_INTERLEAVE_EN(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT)) &                        \
     SIM_CHIPCTL_ADC_INTERLEAVE_EN_MASK)

#define SIM_CHIPCTL_CLKOUTSEL_MASK (0xF0U)
#define SIM_CHIPCTL_CLKOUTSEL_SHIFT (4U)
#define SIM_CHIPCTL_CLKOUTSEL_WIDTH (4U)
#define SIM_CHIPCTL_CLKOUTSEL(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_CLKOUTSEL_SHIFT)) & SIM_CHIPCTL_CLKOUTSEL_MASK)

#define SIM_CHIPCTL_CLKOUTDIV_MASK (0x700U)
#define SIM_CHIPCTL_CLKOUTDIV_SHIFT (8U)
#define SIM_CHIPCTL_CLKOUTDIV_WIDTH (3U)
#define SIM_CHIPCTL_CLKOUTDIV(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_CLKOUTDIV_SHIFT)) & SIM_CHIPCTL_CLKOUTDIV_MASK)

#define SIM_CHIPCTL_CLKOUTEN_MASK (0x800U)
#define SIM_CHIPCTL_CLKOUTEN_SHIFT (11U)
#define SIM_CHIPCTL_CLKOUTEN_WIDTH (1U)
#define SIM_CHIPCTL_CLKOUTEN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_CLKOUTEN_SHIFT)) & SIM_CHIPCTL_CLKOUTEN_MASK)

#define SIM_CHIPCTL_TRACECLK_SEL_MASK (0x1000U)
#define SIM_CHIPCTL_TRACECLK_SEL_SHIFT (12U)
#define SIM_CHIPCTL_TRACECLK_SEL_WIDTH (1U)
#define SIM_CHIPCTL_TRACECLK_SEL(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_TRACECLK_SEL_SHIFT)) &                             \
     SIM_CHIPCTL_TRACECLK_SEL_MASK)

#define SIM_CHIPCTL_PDB_BB_SEL_MASK (0x2000U)
#define SIM_CHIPCTL_PDB_BB_SEL_SHIFT (13U)
#define SIM_CHIPCTL_PDB_BB_SEL_WIDTH (1U)
#define SIM_CHIPCTL_PDB_BB_SEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_PDB_BB_SEL_SHIFT)) & SIM_CHIPCTL_PDB_BB_SEL_MASK)

