rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SIM.h
#define SIM_CHIPCTL_ADC_SUPPLY_MASK (0x70000U)
#define SIM_CHIPCTL_ADC_SUPPLY_SHIFT (16U)
#define SIM_CHIPCTL_ADC_SUPPLY_WIDTH (3U)
#define SIM_CHIPCTL_ADC_SUPPLY(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_ADC_SUPPLY_SHIFT)) & SIM_CHIPCTL_ADC_SUPPLY_MASK)

#define SIM_CHIPCTL_ADC_SUPPLYEN_MASK (0x80000U)
#define SIM_CHIPCTL_ADC_SUPPLYEN_SHIFT (19U)
#define SIM_CHIPCTL_ADC_SUPPLYEN_WIDTH (1U)
#define SIM_CHIPCTL_ADC_SUPPLYEN(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_ADC_SUPPLYEN_SHIFT)) &                             \
     SIM_CHIPCTL_ADC_SUPPLYEN_MASK)

#define SIM_CHIPCTL_SRAMU_RETEN_MASK (0x100000U)
#define SIM_CHIPCTL_SRAMU_RETEN_SHIFT (20U)
#define SIM_CHIPCTL_SRAMU_RETEN_WIDTH (1U)
#define SIM_CHIPCTL_SRAMU_RETEN(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_SRAMU_RETEN_SHIFT)) & SIM_CHIPCTL_SRAMU_RETEN_MASK)

#define SIM_CHIPCTL_SRAML_RETEN_MASK (0x200000U)
#define SIM_CHIPCTL_SRAML_RETEN_SHIFT (21U)
#define SIM_CHIPCTL_SRAML_RETEN_WIDTH (1U)
#define SIM_CHIPCTL_SRAML_RETEN(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_SRAML_RETEN_SHIFT)) & SIM_CHIPCTL_SRAML_RETEN_MASK)

#define SIM_CHIPCTL_PDB_BB_SEL_1_MASK (0x400000U)
#define SIM_CHIPCTL_PDB_BB_SEL_1_SHIFT (22U)
#define SIM_CHIPCTL_PDB_BB_SEL_1_WIDTH (1U)
#define SIM_CHIPCTL_PDB_BB_SEL_1(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_PDB_BB_SEL_1_SHIFT)) &                             \
     SIM_CHIPCTL_PDB_BB_SEL_1_MASK)

#define SIM_CHIPCTL_PDB_BB_SEL_2_MASK (0x800000U)
#define SIM_CHIPCTL_PDB_BB_SEL_2_SHIFT (23U)
#define SIM_CHIPCTL_PDB_BB_SEL_2_WIDTH (1U)
#define SIM_CHIPCTL_PDB_BB_SEL_2(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << SIM_CHIPCTL_PDB_BB_SEL_2_SHIFT)) &                             \
     SIM_CHIPCTL_PDB_BB_SEL_2_MASK)
/*! @} */

/*! @name FTMOPT0 - FTM Option Register 0 */
/*! @{ */

#define SIM_FTMOPT0_FTM0FLTxSEL_MASK (0x7U)
#define SIM_FTMOPT0_FTM0FLTxSEL_SHIFT (0U)
#define SIM_FTMOPT0_FTM0FLTxSEL_WIDTH (3U)
#define SIM_FTMOPT0_FTM0FLTxSEL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM0FLTxSEL_SHIFT)) & SIM_FTMOPT0_FTM0FLTxSEL_MASK)

#define SIM_FTMOPT0_FTM1FLTxSEL_MASK (0x70U)
#define SIM_FTMOPT0_FTM1FLTxSEL_SHIFT (4U)
#define SIM_FTMOPT0_FTM1FLTxSEL_WIDTH (3U)
#define SIM_FTMOPT0_FTM1FLTxSEL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM1FLTxSEL_SHIFT)) & SIM_FTMOPT0_FTM1FLTxSEL_MASK)

#define SIM_FTMOPT0_FTM2FLTxSEL_MASK (0x700U)
#define SIM_FTMOPT0_FTM2FLTxSEL_SHIFT (8U)
#define SIM_FTMOPT0_FTM2FLTxSEL_WIDTH (3U)
#define SIM_FTMOPT0_FTM2FLTxSEL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM2FLTxSEL_SHIFT)) & SIM_FTMOPT0_FTM2FLTxSEL_MASK)

#define SIM_FTMOPT0_FTM3FLTxSEL_MASK (0x7000U)
#define SIM_FTMOPT0_FTM3FLTxSEL_SHIFT (12U)
#define SIM_FTMOPT0_FTM3FLTxSEL_WIDTH (3U)
#define SIM_FTMOPT0_FTM3FLTxSEL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM3FLTxSEL_SHIFT)) & SIM_FTMOPT0_FTM3FLTxSEL_MASK)

#define SIM_FTMOPT0_FTM0CLKSEL_MASK (0x3000000U)
#define SIM_FTMOPT0_FTM0CLKSEL_SHIFT (24U)
#define SIM_FTMOPT0_FTM0CLKSEL_WIDTH (2U)
#define SIM_FTMOPT0_FTM0CLKSEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM0CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM0CLKSEL_MASK)

#define SIM_FTMOPT0_FTM1CLKSEL_MASK (0xC000000U)
#define SIM_FTMOPT0_FTM1CLKSEL_SHIFT (26U)
#define SIM_FTMOPT0_FTM1CLKSEL_WIDTH (2U)
#define SIM_FTMOPT0_FTM1CLKSEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM1CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM1CLKSEL_MASK)

#define SIM_FTMOPT0_FTM2CLKSEL_MASK (0x30000000U)
#define SIM_FTMOPT0_FTM2CLKSEL_SHIFT (28U)
#define SIM_FTMOPT0_FTM2CLKSEL_WIDTH (2U)
#define SIM_FTMOPT0_FTM2CLKSEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM2CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM2CLKSEL_MASK)

#define SIM_FTMOPT0_FTM3CLKSEL_MASK (0xC0000000U)
#define SIM_FTMOPT0_FTM3CLKSEL_SHIFT (30U)
#define SIM_FTMOPT0_FTM3CLKSEL_WIDTH (2U)
#define SIM_FTMOPT0_FTM3CLKSEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT0_FTM3CLKSEL_SHIFT)) & SIM_FTMOPT0_FTM3CLKSEL_MASK)
/*! @} */

/*! @name LPOCLKS - LPO Clock Select Register */
/*! @{ */

#define SIM_LPOCLKS_LPO1KCLKEN_MASK (0x1U)
#define SIM_LPOCLKS_LPO1KCLKEN_SHIFT (0U)
#define SIM_LPOCLKS_LPO1KCLKEN_WIDTH (1U)
#define SIM_LPOCLKS_LPO1KCLKEN(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_LPO1KCLKEN_SHIFT)) & SIM_LPOCLKS_LPO1KCLKEN_MASK)

#define SIM_LPOCLKS_LPO32KCLKEN_MASK (0x2U)
#define SIM_LPOCLKS_LPO32KCLKEN_SHIFT (1U)
#define SIM_LPOCLKS_LPO32KCLKEN_WIDTH (1U)
#define SIM_LPOCLKS_LPO32KCLKEN(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_LPO32KCLKEN_SHIFT)) & SIM_LPOCLKS_LPO32KCLKEN_MASK)

#define SIM_LPOCLKS_LPOCLKSEL_MASK (0xCU)
#define SIM_LPOCLKS_LPOCLKSEL_SHIFT (2U)
#define SIM_LPOCLKS_LPOCLKSEL_WIDTH (2U)
#define SIM_LPOCLKS_LPOCLKSEL(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_LPOCLKSEL_SHIFT)) & SIM_LPOCLKS_LPOCLKSEL_MASK)

#define SIM_LPOCLKS_RTCCLKSEL_MASK (0x30U)
#define SIM_LPOCLKS_RTCCLKSEL_SHIFT (4U)
#define SIM_LPOCLKS_RTCCLKSEL_WIDTH (2U)
#define SIM_LPOCLKS_RTCCLKSEL(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << SIM_LPOCLKS_RTCCLKSEL_SHIFT)) & SIM_LPOCLKS_RTCCLKSEL_MASK)
/*! @} */

/*! @name ADCOPT - ADC Options Register */
/*! @{ */

