rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SIM.h
#define SIM_ADCOPT_ADC0TRGSEL_MASK (0x1U)
#define SIM_ADCOPT_ADC0TRGSEL_SHIFT (0U)
#define SIM_ADCOPT_ADC0TRGSEL_WIDTH (1U)
#define SIM_ADCOPT_ADC0TRGSEL(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC0TRGSEL_SHIFT)) & SIM_ADCOPT_ADC0TRGSEL_MASK)

#define SIM_ADCOPT_ADC0SWPRETRG_MASK (0xEU)
#define SIM_ADCOPT_ADC0SWPRETRG_SHIFT (1U)
#define SIM_ADCOPT_ADC0SWPRETRG_WIDTH (3U)
#define SIM_ADCOPT_ADC0SWPRETRG(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC0SWPRETRG_SHIFT)) & SIM_ADCOPT_ADC0SWPRETRG_MASK)

#define SIM_ADCOPT_ADC0PRETRGSEL_MASK (0x30U)
#define SIM_ADCOPT_ADC0PRETRGSEL_SHIFT (4U)
#define SIM_ADCOPT_ADC0PRETRGSEL_WIDTH (2U)
#define SIM_ADCOPT_ADC0PRETRGSEL(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC0PRETRGSEL_SHIFT)) &                             \
     SIM_ADCOPT_ADC0PRETRGSEL_MASK)

#define SIM_ADCOPT_ADC1TRGSEL_MASK (0x100U)
#define SIM_ADCOPT_ADC1TRGSEL_SHIFT (8U)
#define SIM_ADCOPT_ADC1TRGSEL_WIDTH (1U)
#define SIM_ADCOPT_ADC1TRGSEL(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC1TRGSEL_SHIFT)) & SIM_ADCOPT_ADC1TRGSEL_MASK)

#define SIM_ADCOPT_ADC1SWPRETRG_MASK (0xE00U)
#define SIM_ADCOPT_ADC1SWPRETRG_SHIFT (9U)
#define SIM_ADCOPT_ADC1SWPRETRG_WIDTH (3U)
#define SIM_ADCOPT_ADC1SWPRETRG(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC1SWPRETRG_SHIFT)) & SIM_ADCOPT_ADC1SWPRETRG_MASK)

#define SIM_ADCOPT_ADC1PRETRGSEL_MASK (0x3000U)
#define SIM_ADCOPT_ADC1PRETRGSEL_SHIFT (12U)
#define SIM_ADCOPT_ADC1PRETRGSEL_WIDTH (2U)
#define SIM_ADCOPT_ADC1PRETRGSEL(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << SIM_ADCOPT_ADC1PRETRGSEL_SHIFT)) &                             \
     SIM_ADCOPT_ADC1PRETRGSEL_MASK)
/*! @} */

/*! @name FTMOPT1 - FTM Option Register 1 */
/*! @{ */

#define SIM_FTMOPT1_FTM0SYNCBIT_MASK (0x1U)
#define SIM_FTMOPT1_FTM0SYNCBIT_SHIFT (0U)
#define SIM_FTMOPT1_FTM0SYNCBIT_WIDTH (1U)
#define SIM_FTMOPT1_FTM0SYNCBIT(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM0SYNCBIT_SHIFT)) & SIM_FTMOPT1_FTM0SYNCBIT_MASK)

#define SIM_FTMOPT1_FTM1SYNCBIT_MASK (0x2U)
#define SIM_FTMOPT1_FTM1SYNCBIT_SHIFT (1U)
#define SIM_FTMOPT1_FTM1SYNCBIT_WIDTH (1U)
#define SIM_FTMOPT1_FTM1SYNCBIT(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM1SYNCBIT_SHIFT)) & SIM_FTMOPT1_FTM1SYNCBIT_MASK)

#define SIM_FTMOPT1_FTM2SYNCBIT_MASK (0x4U)
#define SIM_FTMOPT1_FTM2SYNCBIT_SHIFT (2U)
#define SIM_FTMOPT1_FTM2SYNCBIT_WIDTH (1U)
#define SIM_FTMOPT1_FTM2SYNCBIT(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM2SYNCBIT_SHIFT)) & SIM_FTMOPT1_FTM2SYNCBIT_MASK)

#define SIM_FTMOPT1_FTM3SYNCBIT_MASK (0x8U)
#define SIM_FTMOPT1_FTM3SYNCBIT_SHIFT (3U)
#define SIM_FTMOPT1_FTM3SYNCBIT_WIDTH (1U)
#define SIM_FTMOPT1_FTM3SYNCBIT(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM3SYNCBIT_SHIFT)) & SIM_FTMOPT1_FTM3SYNCBIT_MASK)

#define SIM_FTMOPT1_FTM1CH0SEL_MASK (0x30U)
#define SIM_FTMOPT1_FTM1CH0SEL_SHIFT (4U)
#define SIM_FTMOPT1_FTM1CH0SEL_WIDTH (2U)
#define SIM_FTMOPT1_FTM1CH0SEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM1CH0SEL_SHIFT)) & SIM_FTMOPT1_FTM1CH0SEL_MASK)

#define SIM_FTMOPT1_FTM2CH0SEL_MASK (0xC0U)
#define SIM_FTMOPT1_FTM2CH0SEL_SHIFT (6U)
#define SIM_FTMOPT1_FTM2CH0SEL_WIDTH (2U)
#define SIM_FTMOPT1_FTM2CH0SEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM2CH0SEL_SHIFT)) & SIM_FTMOPT1_FTM2CH0SEL_MASK)

#define SIM_FTMOPT1_FTM2CH1SEL_MASK (0x100U)
#define SIM_FTMOPT1_FTM2CH1SEL_SHIFT (8U)
#define SIM_FTMOPT1_FTM2CH1SEL_WIDTH (1U)
#define SIM_FTMOPT1_FTM2CH1SEL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM2CH1SEL_SHIFT)) & SIM_FTMOPT1_FTM2CH1SEL_MASK)

#define SIM_FTMOPT1_FTMGLDOK_MASK (0x8000U)
#define SIM_FTMOPT1_FTMGLDOK_SHIFT (15U)
#define SIM_FTMOPT1_FTMGLDOK_WIDTH (1U)
#define SIM_FTMOPT1_FTMGLDOK(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTMGLDOK_SHIFT)) & SIM_FTMOPT1_FTMGLDOK_MASK)

#define SIM_FTMOPT1_FTM0_OUTSEL_MASK (0xFF0000U)
#define SIM_FTMOPT1_FTM0_OUTSEL_SHIFT (16U)
#define SIM_FTMOPT1_FTM0_OUTSEL_WIDTH (8U)
#define SIM_FTMOPT1_FTM0_OUTSEL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM0_OUTSEL_SHIFT)) & SIM_FTMOPT1_FTM0_OUTSEL_MASK)

#define SIM_FTMOPT1_FTM3_OUTSEL_MASK (0xFF000000U)
#define SIM_FTMOPT1_FTM3_OUTSEL_SHIFT (24U)
#define SIM_FTMOPT1_FTM3_OUTSEL_WIDTH (8U)
#define SIM_FTMOPT1_FTM3_OUTSEL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << SIM_FTMOPT1_FTM3_OUTSEL_SHIFT)) & SIM_FTMOPT1_FTM3_OUTSEL_MASK)
/*! @} */

/*! @name MISCTRL0 - Miscellaneous control register 0 */
/*! @{ */

#define SIM_MISCTRL0_STOP1_MONITOR_MASK (0x200U)
#define SIM_MISCTRL0_STOP1_MONITOR_SHIFT (9U)
#define SIM_MISCTRL0_STOP1_MONITOR_WIDTH (1U)
#define SIM_MISCTRL0_STOP1_MONITOR(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_STOP1_MONITOR_SHIFT)) &                           \
     SIM_MISCTRL0_STOP1_MONITOR_MASK)

#define SIM_MISCTRL0_STOP2_MONITOR_MASK (0x400U)
#define SIM_MISCTRL0_STOP2_MONITOR_SHIFT (10U)
#define SIM_MISCTRL0_STOP2_MONITOR_WIDTH (1U)
#define SIM_MISCTRL0_STOP2_MONITOR(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_STOP2_MONITOR_SHIFT)) &                           \
     SIM_MISCTRL0_STOP2_MONITOR_MASK)

