rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SIM.h
#define SIM_MISCTRL0_ECC_EEERAM_STAT_MASK (0x800U)
#define SIM_MISCTRL0_ECC_EEERAM_STAT_SHIFT (11U)
#define SIM_MISCTRL0_ECC_EEERAM_STAT_WIDTH (1U)
#define SIM_MISCTRL0_ECC_EEERAM_STAT(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_ECC_EEERAM_STAT_SHIFT)) &                         \
     SIM_MISCTRL0_ECC_EEERAM_STAT_MASK)

#define SIM_MISCTRL0_ECC_MGRAM_STAT_MASK (0x1000U)
#define SIM_MISCTRL0_ECC_MGRAM_STAT_SHIFT (12U)
#define SIM_MISCTRL0_ECC_MGRAM_STAT_WIDTH (1U)
#define SIM_MISCTRL0_ECC_MGRAM_STAT(x)                                                             \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_ECC_MGRAM_STAT_SHIFT)) &                          \
     SIM_MISCTRL0_ECC_MGRAM_STAT_MASK)

#define SIM_MISCTRL0_FTM0_OBE_CTRL_MASK (0x10000U)
#define SIM_MISCTRL0_FTM0_OBE_CTRL_SHIFT (16U)
#define SIM_MISCTRL0_FTM0_OBE_CTRL_WIDTH (1U)
#define SIM_MISCTRL0_FTM0_OBE_CTRL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM0_OBE_CTRL_SHIFT)) &                           \
     SIM_MISCTRL0_FTM0_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM1_OBE_CTRL_MASK (0x20000U)
#define SIM_MISCTRL0_FTM1_OBE_CTRL_SHIFT (17U)
#define SIM_MISCTRL0_FTM1_OBE_CTRL_WIDTH (1U)
#define SIM_MISCTRL0_FTM1_OBE_CTRL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM1_OBE_CTRL_SHIFT)) &                           \
     SIM_MISCTRL0_FTM1_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM2_OBE_CTRL_MASK (0x40000U)
#define SIM_MISCTRL0_FTM2_OBE_CTRL_SHIFT (18U)
#define SIM_MISCTRL0_FTM2_OBE_CTRL_WIDTH (1U)
#define SIM_MISCTRL0_FTM2_OBE_CTRL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM2_OBE_CTRL_SHIFT)) &                           \
     SIM_MISCTRL0_FTM2_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM3_OBE_CTRL_MASK (0x80000U)
#define SIM_MISCTRL0_FTM3_OBE_CTRL_SHIFT (19U)
#define SIM_MISCTRL0_FTM3_OBE_CTRL_WIDTH (1U)
#define SIM_MISCTRL0_FTM3_OBE_CTRL(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM3_OBE_CTRL_SHIFT)) &                           \
     SIM_MISCTRL0_FTM3_OBE_CTRL_MASK)
/*! @} */

/*! @name SDID - System Device Identification Register */
/*! @{ */

#define SIM_SDID_FEATURES_MASK (0xFFU)
#define SIM_SDID_FEATURES_SHIFT (0U)
#define SIM_SDID_FEATURES_WIDTH (8U)
#define SIM_SDID_FEATURES(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SIM_SDID_FEATURES_SHIFT)) & SIM_SDID_FEATURES_MASK)

#define SIM_SDID_PACKAGE_MASK (0xF00U)
#define SIM_SDID_PACKAGE_SHIFT (8U)
#define SIM_SDID_PACKAGE_WIDTH (4U)
#define SIM_SDID_PACKAGE(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SIM_SDID_PACKAGE_SHIFT)) & SIM_SDID_PACKAGE_MASK)

#define SIM_SDID_REVID_MASK (0xF000U)
#define SIM_SDID_REVID_SHIFT (12U)
#define SIM_SDID_REVID_WIDTH (4U)
#define SIM_SDID_REVID(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << SIM_SDID_REVID_SHIFT)) & SIM_SDID_REVID_MASK)

#define SIM_SDID_RAMSIZE_MASK (0xF0000U)
#define SIM_SDID_RAMSIZE_SHIFT (16U)
#define SIM_SDID_RAMSIZE_WIDTH (4U)
#define SIM_SDID_RAMSIZE(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SIM_SDID_RAMSIZE_SHIFT)) & SIM_SDID_RAMSIZE_MASK)

#define SIM_SDID_DERIVATE_MASK (0xF00000U)
#define SIM_SDID_DERIVATE_SHIFT (20U)
#define SIM_SDID_DERIVATE_WIDTH (4U)
#define SIM_SDID_DERIVATE(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SIM_SDID_DERIVATE_SHIFT)) & SIM_SDID_DERIVATE_MASK)

#define SIM_SDID_SUBSERIES_MASK (0xF000000U)
#define SIM_SDID_SUBSERIES_SHIFT (24U)
#define SIM_SDID_SUBSERIES_WIDTH (4U)
#define SIM_SDID_SUBSERIES(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_SDID_SUBSERIES_SHIFT)) & SIM_SDID_SUBSERIES_MASK)

#define SIM_SDID_GENERATION_MASK (0xF0000000U)
#define SIM_SDID_GENERATION_SHIFT (28U)
#define SIM_SDID_GENERATION_WIDTH (4U)
#define SIM_SDID_GENERATION(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SIM_SDID_GENERATION_SHIFT)) & SIM_SDID_GENERATION_MASK)
/*! @} */

/*! @name PLATCGC - Platform Clock Gating Control Register */
/*! @{ */

#define SIM_PLATCGC_CGCMSCM_MASK (0x1U)
#define SIM_PLATCGC_CGCMSCM_SHIFT (0U)
#define SIM_PLATCGC_CGCMSCM_WIDTH (1U)
#define SIM_PLATCGC_CGCMSCM(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SIM_PLATCGC_CGCMSCM_SHIFT)) & SIM_PLATCGC_CGCMSCM_MASK)

#define SIM_PLATCGC_CGCMPU_MASK (0x2U)
#define SIM_PLATCGC_CGCMPU_SHIFT (1U)
#define SIM_PLATCGC_CGCMPU_WIDTH (1U)
#define SIM_PLATCGC_CGCMPU(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_PLATCGC_CGCMPU_SHIFT)) & SIM_PLATCGC_CGCMPU_MASK)

#define SIM_PLATCGC_CGCDMA_MASK (0x4U)
#define SIM_PLATCGC_CGCDMA_SHIFT (2U)
#define SIM_PLATCGC_CGCDMA_WIDTH (1U)
#define SIM_PLATCGC_CGCDMA(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_PLATCGC_CGCDMA_SHIFT)) & SIM_PLATCGC_CGCDMA_MASK)

#define SIM_PLATCGC_CGCERM_MASK (0x8U)
#define SIM_PLATCGC_CGCERM_SHIFT (3U)
#define SIM_PLATCGC_CGCERM_WIDTH (1U)
#define SIM_PLATCGC_CGCERM(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_PLATCGC_CGCERM_SHIFT)) & SIM_PLATCGC_CGCERM_MASK)

#define SIM_PLATCGC_CGCEIM_MASK (0x10U)
#define SIM_PLATCGC_CGCEIM_SHIFT (4U)
#define SIM_PLATCGC_CGCEIM_WIDTH (1U)
#define SIM_PLATCGC_CGCEIM(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_PLATCGC_CGCEIM_SHIFT)) & SIM_PLATCGC_CGCEIM_MASK)
/*! @} */

/*! @name FCFG1 - Flash Configuration Register 1 */
/*! @{ */

#define SIM_FCFG1_DEPART_MASK (0xF000U)
#define SIM_FCFG1_DEPART_SHIFT (12U)
#define SIM_FCFG1_DEPART_WIDTH (4U)
#define SIM_FCFG1_DEPART(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SIM_FCFG1_DEPART_SHIFT)) & SIM_FCFG1_DEPART_MASK)

#define SIM_FCFG1_EEERAMSIZE_MASK (0xF0000U)
#define SIM_FCFG1_EEERAMSIZE_SHIFT (16U)
#define SIM_FCFG1_EEERAMSIZE_WIDTH (4U)
#define SIM_FCFG1_EEERAMSIZE(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SIM_FCFG1_EEERAMSIZE_SHIFT)) & SIM_FCFG1_EEERAMSIZE_MASK)
/*! @} */

/*! @name UIDH - Unique Identification Register High */
/*! @{ */

#define SIM_UIDH_UID127_96_MASK (0xFFFFFFFFU)
#define SIM_UIDH_UID127_96_SHIFT (0U)
#define SIM_UIDH_UID127_96_WIDTH (32U)
#define SIM_UIDH_UID127_96(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_UIDH_UID127_96_SHIFT)) & SIM_UIDH_UID127_96_MASK)
/*! @} */

/*! @name UIDMH - Unique Identification Register Mid-High */
/*! @{ */

#define SIM_UIDMH_UID95_64_MASK (0xFFFFFFFFU)
#define SIM_UIDMH_UID95_64_SHIFT (0U)
#define SIM_UIDMH_UID95_64_WIDTH (32U)
#define SIM_UIDMH_UID95_64(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_UIDMH_UID95_64_SHIFT)) & SIM_UIDMH_UID95_64_MASK)
/*! @} */

/*! @name UIDML - Unique Identification Register Mid Low */
/*! @{ */

#define SIM_UIDML_UID63_32_MASK (0xFFFFFFFFU)
#define SIM_UIDML_UID63_32_SHIFT (0U)
#define SIM_UIDML_UID63_32_WIDTH (32U)
#define SIM_UIDML_UID63_32(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SIM_UIDML_UID63_32_SHIFT)) & SIM_UIDML_UID63_32_MASK)
/*! @} */

