rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SIM.h
/*! @name UIDL - Unique Identification Register Low */
/*! @{ */

#define SIM_UIDL_UID31_0_MASK (0xFFFFFFFFU)
#define SIM_UIDL_UID31_0_SHIFT (0U)
#define SIM_UIDL_UID31_0_WIDTH (32U)
#define SIM_UIDL_UID31_0(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SIM_UIDL_UID31_0_SHIFT)) & SIM_UIDL_UID31_0_MASK)
/*! @} */

/*! @name CLKDIV4 - System Clock Divider Register 4 */
/*! @{ */

#define SIM_CLKDIV4_TRACEFRAC_MASK (0x1U)
#define SIM_CLKDIV4_TRACEFRAC_SHIFT (0U)
#define SIM_CLKDIV4_TRACEFRAC_WIDTH (1U)
#define SIM_CLKDIV4_TRACEFRAC(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << SIM_CLKDIV4_TRACEFRAC_SHIFT)) & SIM_CLKDIV4_TRACEFRAC_MASK)

#define SIM_CLKDIV4_TRACEDIV_MASK (0xEU)
#define SIM_CLKDIV4_TRACEDIV_SHIFT (1U)
#define SIM_CLKDIV4_TRACEDIV_WIDTH (3U)
#define SIM_CLKDIV4_TRACEDIV(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SIM_CLKDIV4_TRACEDIV_SHIFT)) & SIM_CLKDIV4_TRACEDIV_MASK)

#define SIM_CLKDIV4_TRACEDIVEN_MASK (0x10000000U)
#define SIM_CLKDIV4_TRACEDIVEN_SHIFT (28U)
#define SIM_CLKDIV4_TRACEDIVEN_WIDTH (1U)
#define SIM_CLKDIV4_TRACEDIVEN(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SIM_CLKDIV4_TRACEDIVEN_SHIFT)) & SIM_CLKDIV4_TRACEDIVEN_MASK)
/*! @} */

/*! @name MISCTRL1 - Miscellaneous Control register 1 */
/*! @{ */

#define SIM_MISCTRL1_SW_TRG_MASK (0x1U)
#define SIM_MISCTRL1_SW_TRG_SHIFT (0U)
#define SIM_MISCTRL1_SW_TRG_WIDTH (1U)
#define SIM_MISCTRL1_SW_TRG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL1_SW_TRG_SHIFT)) & SIM_MISCTRL1_SW_TRG_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SIM_Register_Masks */

/*!
 * @}
 */ /* end of group SIM_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_SIM_H_) */
